Revit 2026 API

# FilteredWorksetIterator Class

---

An iterator to a set of worksets filtered by the settings of a FilteredWorksetCollector.

SystemObject Autodesk.Revit.DBFilteredWorksetIterator

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class FilteredWorksetIterator : IEnumerator<Workset>
```
```vb
Public Class FilteredWorksetIterator
	Implements IEnumerator(Of Workset)
```
```cpp
public ref class FilteredWorksetIterator : IEnumerator<Workset^>
```
```fsharp
type FilteredWorksetIterator =
    class
        interface IEnumerator<Workset>
    end
```

The FilteredWorksetIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Current | Gets the item at the current position of the iterator. |
|  | CurrentObject |  |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the FilteredWorksetIterator |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetCurrent | The current workset found by the iterator. |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | IsDone | Identifies if the iteration has completed. |
|  | MoveNext | Increments the iterator to the next workset passing the filter. |
|  | Reset | Resets the iterator to the beginning. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB Namespace